; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-8-11)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p1-2 - location
	p1-5 - location
	p3-0 - location
	p3-1 - location
	p3-2 - location
	p3-4 - location
	p4-2 - location
	p5-3 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s2)
	(at driver4 s3)
	(at driver5 s2)
	(at driver6 s5)
	(at driver7 s2)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s5)
	(empty truck6)
	(at truck7 s4)
	(empty truck7)
	(at truck8 s2)
	(empty truck8)
	(at package1 s3)
	(at package2 s2)
	(at package3 s4)
	(at package4 s4)
	(at package5 s4)
	(at package6 s3)
	(at package7 s3)
	(at package8 s3)
	(at package9 s3)
	(at package10 s1)
	(at package11 s5)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(link s0 s3)
	(link s3 s0)
	(link s0 s4)
	(link s4 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s5)
	(link s5 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
	(link s3 s1)
	(link s1 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s2)
	(link s2 s4)
	(link s4 s3)
	(link s3 s4)
	(link s4 s5)
	(link s5 s4)
	(link s5 s2)
	(link s2 s5)
	(link s5 s3)
	(link s3 s5)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s5)
	(at driver4 s4)
	(at driver6 s0)
	(at driver7 s4)
	(at truck1 s1)
	(at truck3 s3)
	(at truck6 s1)
	(at truck7 s5)
	(at truck8 s1)
	(at package1 s0)
	(at package2 s3)
	(at package3 s4)
	(at package4 s2)
	(at package5 s4)
	(at package6 s2)
	(at package7 s3)
	(at package8 s3)
	(at package9 s2)
	(at package10 s4)
	(at package11 s1)
	))


)

; plan
1. (walk driver5 s2 p1-2)
   deleted: (at driver5 s2)
   added: (at driver5 p1-2)
   goals met: 7 of 22
2. (walk driver5 p1-2 s1)
   deleted: (at driver5 p1-2)
   added: (at driver5 s1)
   goals met: 7 of 22
3. (board-truck driver5 s1 truck3)
   deleted: (at driver5 s1) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 7 of 22
4. (drive-truck driver5 s1 s3 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   goals met: 8 of 22
5. (board-truck driver6 s5 truck6)
   deleted: (at driver6 s5) (empty truck6)
   added: (driving driver6 truck6)
   goals met: 8 of 22
6. (board-truck driver3 s2 truck8)
   deleted: (at driver3 s2) (empty truck8)
   added: (driving driver3 truck8)
   goals met: 8 of 22
7. (load-truck s3 package9 truck3)
   deleted: (at package9 s3)
   added: (in package9 truck3)
   goals met: 8 of 22
8. (load-truck s3 package6 truck3)
   deleted: (at package6 s3)
   added: (in package6 truck3)
   goals met: 8 of 22
9. (load-truck s3 package1 truck3)
   deleted: (at package1 s3)
   added: (in package1 truck3)
   goals met: 8 of 22
10. (drive-truck driver5 s3 s2 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   goals met: 7 of 22
11. (unload-truck s2 package9 truck3)
   deleted: (in package9 truck3)
   added: (at package9 s2)
   goals met: 8 of 22
12. (drive-truck driver5 s2 s4 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   goals met: 8 of 22
13. (load-truck s4 package4 truck3)
   deleted: (at package4 s4)
   added: (in package4 truck3)
   goals met: 8 of 22
14. (drive-truck driver5 s4 s2 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   goals met: 8 of 22
15. (unload-truck s2 package6 truck3)
   deleted: (in package6 truck3)
   added: (at package6 s2)
   goals met: 9 of 22
16. (unload-truck s2 package4 truck3)
   deleted: (in package4 truck3)
   added: (at package4 s2)
   goals met: 10 of 22
17. (drive-truck driver5 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 10 of 22
18. (unload-truck s0 package1 truck3)
   deleted: (in package1 truck3)
   added: (at package1 s0)
   goals met: 11 of 22
19. (drive-truck driver5 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 12 of 22
20. (drive-truck driver6 s5 s1 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s1)
   goals met: 13 of 22
21. (load-truck s1 package10 truck6)
   deleted: (at package10 s1)
   added: (in package10 truck6)
   goals met: 13 of 22
22. (drive-truck driver6 s1 s4 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   goals met: 12 of 22
23. (unload-truck s4 package10 truck6)
   deleted: (in package10 truck6)
   added: (at package10 s4)
   goals met: 13 of 22
24. (drive-truck driver3 s2 s5 truck8)
   deleted: (at truck8 s2)
   added: (at truck8 s5)
   goals met: 13 of 22
25. (load-truck s5 package11 truck8)
   deleted: (at package11 s5)
   added: (in package11 truck8)
   goals met: 13 of 22
26. (drive-truck driver3 s5 s1 truck8)
   deleted: (at truck8 s5)
   added: (at truck8 s1)
   goals met: 14 of 22
27. (unload-truck s1 package11 truck8)
   deleted: (in package11 truck8)
   added: (at package11 s1)
   goals met: 15 of 22
28. (walk driver4 s3 p3-4)
   deleted: (at driver4 s3)
   added: (at driver4 p3-4)
   goals met: 15 of 22
29. (drive-truck driver6 s4 s2 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s2)
   goals met: 15 of 22
30. (load-truck s2 package2 truck6)
   deleted: (at package2 s2)
   added: (in package2 truck6)
   goals met: 15 of 22
31. (drive-truck driver6 s2 s3 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s3)
   goals met: 15 of 22
32. (unload-truck s3 package2 truck6)
   deleted: (in package2 truck6)
   added: (at package2 s3)
   goals met: 16 of 22
33. (drive-truck driver6 s3 s0 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   goals met: 16 of 22
34. (drive-truck driver6 s0 s4 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s4)
   goals met: 16 of 22
35. (disembark-truck driver6 s4 truck6)
   deleted: (driving driver6 truck6)
   added: (at driver6 s4) (empty truck6)
   goals met: 16 of 22
36. (walk driver4 p3-4 s4)
   deleted: (at driver4 p3-4)
   added: (at driver4 s4)
   goals met: 17 of 22
37. (board-truck driver6 s4 truck4)
   deleted: (at driver6 s4) (empty truck4)
   added: (driving driver6 truck4)
   goals met: 17 of 22
38. (drive-truck driver6 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 17 of 22
39. (disembark-truck driver6 s0 truck4)
   deleted: (driving driver6 truck4)
   added: (at driver6 s0) (empty truck4)
   goals met: 18 of 22
40. (drive-truck driver3 s1 s5 truck8)
   deleted: (at truck8 s1)
   added: (at truck8 s5)
   goals met: 17 of 22
41. (board-truck driver4 s4 truck6)
   deleted: (at driver4 s4) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 16 of 22
42. (drive-truck driver4 s4 s1 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   goals met: 17 of 22
43. (drive-truck driver3 s5 s4 truck8)
   deleted: (at truck8 s5)
   added: (at truck8 s4)
   goals met: 17 of 22
44. (disembark-truck driver3 s4 truck8)
   deleted: (driving driver3 truck8)
   added: (at driver3 s4) (empty truck8)
   goals met: 17 of 22
45. (board-truck driver3 s4 truck7)
   deleted: (at driver3 s4) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 17 of 22
46. (drive-truck driver3 s4 s5 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s5)
   goals met: 18 of 22
47. (drive-truck driver4 s1 s4 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   goals met: 17 of 22
48. (disembark-truck driver4 s4 truck6)
   deleted: (driving driver4 truck6)
   added: (at driver4 s4) (empty truck6)
   goals met: 18 of 22
49. (disembark-truck driver3 s5 truck7)
   deleted: (driving driver3 truck7)
   added: (at driver3 s5) (empty truck7)
   goals met: 19 of 22
50. (board-truck driver4 s4 truck6)
   deleted: (at driver4 s4) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 18 of 22
51. (drive-truck driver4 s4 s1 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   goals met: 19 of 22
52. (drive-truck driver5 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 18 of 22
53. (disembark-truck driver5 s4 truck3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s4) (empty truck3)
   goals met: 18 of 22
54. (walk driver7 s2 p4-2)
   deleted: (at driver7 s2)
   added: (at driver7 p4-2)
   goals met: 18 of 22
55. (walk driver7 p4-2 s4)
   deleted: (at driver7 p4-2)
   added: (at driver7 s4)
   goals met: 19 of 22
56. (board-truck driver7 s4 truck3)
   deleted: (at driver7 s4) (empty truck3)
   added: (driving driver7 truck3)
   goals met: 18 of 22
57. (board-truck driver5 s4 truck8)
   deleted: (at driver5 s4) (empty truck8)
   added: (driving driver5 truck8)
   goals met: 18 of 22
58. (drive-truck driver5 s4 s1 truck8)
   deleted: (at truck8 s4)
   added: (at truck8 s1)
   goals met: 19 of 22
59. (drive-truck driver7 s4 s3 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   goals met: 20 of 22
60. (disembark-truck driver7 s3 truck3)
   deleted: (driving driver7 truck3)
   added: (at driver7 s3) (empty truck3)
   goals met: 20 of 22
61. (walk driver7 s3 p3-4)
   deleted: (at driver7 s3)
   added: (at driver7 p3-4)
   goals met: 20 of 22
62. (walk driver7 p3-4 s4)
   deleted: (at driver7 p3-4)
   added: (at driver7 s4)
   goals met: 21 of 22
63. (disembark-truck driver5 s1 truck8)
   deleted: (driving driver5 truck8)
   added: (at driver5 s1) (empty truck8)
   goals met: 21 of 22
64. (walk driver5 s1 p1-2)
   deleted: (at driver5 s1)
   added: (at driver5 p1-2)
   goals met: 21 of 22
65. (walk driver5 p1-2 s2)
   deleted: (at driver5 p1-2)
   added: (at driver5 s2)
   goals met: 21 of 22
66. (walk driver5 s2 p4-2)
   deleted: (at driver5 s2)
   added: (at driver5 p4-2)
   goals met: 21 of 22
67. (walk driver5 p4-2 s4)
   deleted: (at driver5 p4-2)
   added: (at driver5 s4)
   goals met: 21 of 22
68. (drive-truck driver4 s1 s4 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   goals met: 20 of 22
69. (disembark-truck driver4 s4 truck6)
   deleted: (driving driver4 truck6)
   added: (at driver4 s4) (empty truck6)
   goals met: 21 of 22
70. (board-truck driver5 s4 truck6)
   deleted: (at driver5 s4) (empty truck6)
   added: (driving driver5 truck6)
   goals met: 21 of 22
71. (drive-truck driver5 s4 s1 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   goals met: 22 of 22
